diplom-src/src/Documents/ВКМ_ГрафикОтпусков/ВКМ_ГрафикОтпусков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_ГрафикОтпусков</name>
  <registerRecords>InformationRegister.ВКМ_ГрафикОтпусков</registerRecords>
  <attributes>
    <name>ВКМ_Год</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ВКМ_ОтпускаСотрудников</name>
    <attributes>
      <name>ВКМ_Сотрудник</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>ВКМ_ДатаНачала</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВКМ_ДатаОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВКМ_ЧислоДнейОтпуска</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

diplom-src/src/Documents/ВКМ_ГрафикОтпусков/Forms/ФормаАнализГрафика/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ТЧ = ПолучитьИзВременногоХранилища(Параметры.Объект);
	Год = ПолучитьИзВременногоХранилища(Параметры.Год);
	
	ВКМ_ДГ.Обновление = Ложь;
	ВКМ_ДГ.АвтоОпределениеПолногоИнтервала = Ложь;
	ВКМ_ДГ.Очистить();
	
	ВКМ_ДГ.УстановитьПолныйИнтервал(НачалоГода(Год), КонецГода(Год));
	Серия = ВКМ_ДГ.УстановитьСерию("Отпуска");
		
	Для Каждого Сотрудник Из ТЧ Цикл 
		
		Точка = ВКМ_ДГ.УстановитьТочку(Сотрудник.ВКМ_Сотрудник);
		Точка.Картинка = БиблиотекаКартинок.СостояниеПользователя02;
		Значение = ВКМ_ДГ.ПолучитьЗначение(Точка, Серия);
		Значение.Данные.ВКМ_ДнейОтпуска = Значение.Данные.ВКМ_ДнейОтпуска + Сотрудник.ВКМ_ЧислоДнейОтпуска;
		Если Сотрудник.ВКМ_ЧислоДнейОтпуска > 28 Тогда 
			Значение.ЦветФона = WebЦвета.ЗеленоЖелтый;
		КонецЕсли;
				
		Интервал = Значение.Добавить();
		Интервал.Начало = Сотрудник.ВКМ_ДатаНачала;
		Интервал.Конец = Сотрудник.ВКМ_ДатаОкончания;
		
	КонецЦикла;
	
	Шкала = ВКМ_ДГ.ОбластьПостроения.ШкалаВремени.Элементы[0];
	Шкала.Метки.Очистить();
	МеткиВремени = Шкала.Метки.Добавить(НачалоДня(ТекущаяДата())); 
	МеткиВремени.Текст = "Текущая дата " + Формат(ТекущаяДата(), "ДФ=dd.MM.yyyy");
	МеткиВремени.ЦветТекста = WebЦвета.Охра;
	МеткиВремени.ЦветЛинии = WebЦвета.Охра; 
	
	ВКМ_ДГ.Обновление = Истина;
	
КонецПроцедуры
